{
  "backend/main.mo": "Main Motoko actor implementing a live TV backend with channel management, user profiles, favourites, and playlists, all protected by role-based access control (admin/user permissions).",
  "feature_evidence.json": "Feature evidence report confirming that dark mode is enforced app-wide via the 'dark' class on the HTML root element and consolidated CSS variable tokens in index.css.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of every frontend source file, serving as a build-planning reference for the project's React/Tailwind frontend.",
  "frontend/index.css": "Tailwind base stylesheet defining light-mode CSS variable tokens in :root and dark-mode overrides in .dark, covering background, foreground, card, sidebar, and chart color tokens.",
  "frontend/index.html": "HTML entry point with the 'dark' class permanently set on the <html> element, loading Inter/Barlow Condensed fonts, hls.js, and the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React component that simply renders the ChannelBrowser page without additional providers.",
  "frontend/src/components/AddChannelModal.tsx": "Modal dialog for adding a new IPTV channel with form fields for name, stream URL, thumbnail, language, and country, including client-side validation.",
  "frontend/src/components/AddToPlaylistPopover.tsx": "Popover component that lists the authenticated user's playlists and allows toggling a given channel's membership in each playlist via add/remove mutations.",
  "frontend/src/components/ChannelCard.tsx": "Renders a single channel card with thumbnail, live badge, favourite toggle, and playlist popover; selection and authentication state control visual styling and button availability.",
  "frontend/src/components/ChannelGrid.tsx": "Displays a responsive grid of ChannelCard components with loading skeleton states and an empty-state message when no channels are available.",
  "frontend/src/components/CreatePlaylistModal.tsx": "Modal dialog with a form for creating a new named playlist, using the useCreatePlaylist mutation and showing validation/error feedback.",
  "frontend/src/components/FilterControls.tsx": "Provides a search input plus language and country dropdown filters for narrowing the channel list, with a clear-filters button when filters are active.",
  "frontend/src/components/M3UChannelCard.tsx": "Renders a card for a locally-parsed M3U channel with thumbnail, live badge, selection indicator, and a standalone favourite toggle (no playlist or auth integration).",
  "frontend/src/components/M3UChannelGrid.tsx": "Displays a responsive grid of M3UChannelCard components with skeleton loading states and an empty-state message, mirroring ChannelGrid but for M3U channel data.",
  "frontend/src/components/M3UVideoPlayer.tsx": "A React video player component for M3U channels that uses HLS.js for streaming, with support for fullscreen mode, auto-hiding overlay controls, and favourite toggling.",
  "frontend/src/components/Navigation.tsx": "A sticky header navigation component that handles Internet Identity auth, playlist filtering (all/favourites/playlist), playlist creation, and deletion via a dropdown menu.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog for first-time users to set a display name, which is saved via the backend profile mutation before completing onboarding.",
  "frontend/src/components/VideoPlayer.tsx": "A React video player for backend Channel objects that uses HLS.js with error recovery, loading/mute states, fullscreen support, and auto-hiding overlay controls.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, managing AuthClient creation, login/logout flows, identity persistence, and delegation validity checks.",
  "frontend/src/hooks/useLocalFavourites.ts": "A hook that persists a set of favourite channel IDs to localStorage, exposing toggle and lookup helpers.",
  "frontend/src/hooks/useM3UChannels.ts": "A React Query hook that fetches and parses an M3U playlist URL, falling back to a CORS proxy if the direct fetch fails.",
  "frontend/src/hooks/useManualChannels.ts": "React hook that manages a local list of manually added M3U channels, providing an `addChannel` function that prepends new channels with unique IDs.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating backend data including channels, favourites, user profiles, and playlists via an actor interface.",
  "frontend/src/index.css": "Global stylesheet defining a dark cinematic theme with CSS custom properties, Tailwind directives, custom utility classes, scrollbar styling, and a red pulse animation.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/ChannelBrowser.tsx": "Main page component that combines M3U and manually added channels with filtering by favourites, playlists, language, country, and search, and renders a video player and modals.",
  "frontend/src/utils/m3uParser.ts": "Parses M3U playlist text into an array of `M3UChannel` objects by extracting name, stream URL, logo, language, and country from `#EXTINF` entries.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters (supporting both regular and hash-based routing), persisting them in sessionStorage, and removing sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom OKLCH-based color tokens, display fonts, border radii, glow shadows, and animation keyframes for a dark cinematic UI.",
  "project_state.json": "Tracks project state (version 17) for an IPTV live TV app with known issues around M3U channel loading and dark mode rendering, listing existing features and architectural notes."
}