{
  "backend/main.mo": "Main Motoko actor implementing a live TV backend with channel management, user profiles, favourites, and playlists — all protected by role-based access control (admin/user permissions).",
  "feature_evidence.json": "Feature evidence report linking the 'Favourites' section/page view feature (REQ-17) to its implementing files: Navigation.tsx and ChannelBrowser.tsx.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of all frontend source files, serving as a reference index for the project's frontend components, hooks, pages, and utilities.",
  "frontend/index.css": "Global CSS file that defines Tailwind base styles and OKLCH CSS custom properties for both light and dark themes, covering background, foreground, card, primary, secondary, and sidebar color tokens.",
  "frontend/index.html": "HTML entry point for the StreamVault app, loading Inter and Barlow Condensed fonts from Google Fonts and the hls.js CDN script for HLS stream playback.",
  "frontend/src/App.tsx": "Root React component that simply renders the ChannelBrowser page inside the app tree.",
  "frontend/src/components/AddChannelModal.tsx": "Modal dialog component for adding a new IPTV channel, with form fields for name, stream URL, thumbnail, language, and country, plus client-side validation.",
  "frontend/src/components/AddToPlaylistPopover.tsx": "Popover component that lets authenticated users add or remove a backend channel from any of their playlists, with loading and pending states per playlist.",
  "frontend/src/components/ChannelCard.tsx": "Renders a single channel card with thumbnail, live badge, favourite toggle, and playlist popover; supports selected state and requires authentication for interactive actions.",
  "frontend/src/components/ChannelGrid.tsx": "Displays a responsive grid of ChannelCard components with loading skeleton states and an empty-state message when no channels are available.",
  "frontend/src/components/CreatePlaylistModal.tsx": "Modal dialog for creating a new playlist by entering a name, using the useCreatePlaylist mutation with validation and error handling.",
  "frontend/src/components/FilterControls.tsx": "Provides a search input plus language and country dropdown filters for narrowing the channel list, with a clear-filters button when filters are active.",
  "frontend/src/components/M3UChannelCard.tsx": "Renders a single M3U channel card with thumbnail, live badge, selected indicator, and a local favourite toggle button, mirroring ChannelCard but for M3U-parsed channels.",
  "frontend/src/components/M3UChannelGrid.tsx": "Displays a responsive grid of M3UChannelCard components with skeleton loading states and an empty-state message, analogous to ChannelGrid but for M3U channels.",
  "frontend/src/components/M3UVideoPlayer.tsx": "A React video player component for M3U channels that uses HLS.js for streaming, with support for fullscreen mode, auto-hiding overlay controls, and favourite toggling.",
  "frontend/src/components/Navigation.tsx": "A sticky header navigation component that handles Internet Identity auth, playlist filtering (all/favourites/playlist), playlist creation, and deletion via a dropdown menu.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog for first-time users to set a display name, which is saved via the backend profile mutation before completing onboarding.",
  "frontend/src/components/VideoPlayer.tsx": "A React video player for backend Channel objects that uses HLS.js with error recovery, loading/mute states, fullscreen support, and auto-hiding overlay controls.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing ICP Internet Identity authentication state, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useLocalFavourites.ts": "A hook that persists a set of favourite channel IDs to localStorage, exposing toggle and lookup helpers.",
  "frontend/src/hooks/useM3UChannels.ts": "A React Query hook that fetches and parses an M3U playlist URL, falling back to a CORS proxy if the direct fetch fails, and caches results for 10 minutes.",
  "frontend/src/hooks/useManualChannels.ts": "React hook that manages a local list of manually added M3U channels, providing an `addChannel` function that creates uniquely-IDed channel objects and prepends them to state.",
  "frontend/src/hooks/useQueries.ts": "Centralizes React Query hooks for fetching and mutating backend data including channels, favourites, user profiles, and playlists via the ICP actor.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures Tailwind, and defines a dark cinematic CSS variable theme with custom utilities, scrollbar styles, and a pulse animation.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/ChannelBrowser.tsx": "Main page component that loads M3U and manually added channels, handles filtering by favourites/playlists/language/country/search, and renders the channel grid, video player, and modals.",
  "frontend/src/utils/m3uParser.ts": "Parses M3U playlist text into an array of typed `M3UChannel` objects by extracting stream URLs and attributes like name, logo, language, and country.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters (supporting hash-based routing), persisting them to sessionStorage, and cleaning sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with custom fonts, oklch-based CSS variable colors, border radii, box shadows, and keyframe animations for the dark cinematic UI.",
  "project_state.json": "Tracks project state, version, architectural notes, known issues, and a list of existing implemented features for an IPTV live TV browser app with HLS playback, filtering, favourites, and dark theme."
}