{
  "kind": "build_request",
  "title": "Fix UI rendering in dark mode",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-18",
      "text": "Ensure the entire app renders in dark mode by default. The HTML root element must have the 'dark' class applied at all times (or the app must be configured to always use the dark color scheme). All components — including the navigation bar, channel grid, channel cards, filter controls, video player, and modals — must use the dark cinematic CSS variable tokens (deep dark backgrounds #0d0d0d to #1a1a2e, red/amber accents) already defined in frontend/src/index.css. Remove or override any light-mode fallback styles that are causing components to render with light backgrounds or light text.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Ui still in light mode i like dark mode  please change to dark mode"
        ]
      },
      "acceptanceCriteria": [
        "The app loads in dark mode without any manual toggle required.",
        "The HTML <html> or <body> element has the 'dark' class applied on initial load.",
        "All page backgrounds render as deep dark (#0d0d0d to #1a1a2e range), not white or light grey.",
        "All text elements render in light/white tones against the dark background.",
        "Channel cards, navigation bar, filter controls, modals, and the video player all display dark backgrounds consistent with the cinematic theme.",
        "No component falls back to light-mode colors under any condition."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "Do not introduce a light/dark toggle — dark mode must be the only mode.",
    "Preserve all existing dark cinematic CSS variable definitions in frontend/src/index.css; only fix the mode activation mechanism."
  ],
  "nonGoals": [
    "Adding a user-facing theme toggle or light mode option.",
    "Changing the existing color palette or design tokens.",
    "Any backend changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}