{
  "kind": "build_request",
  "title": "Add dedicated Favourites section to channel browser",
  "projectName": "StreamVault",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-17",
      "text": "Add a dedicated 'Favourites' section/page view in the channel browser that displays only the channels the user has marked as favourites. For M3U/guest users, show channels whose IDs are stored in useLocalFavourites. For authenticated users, show channels from the backend getFavourites list. The section must be accessible via the existing 'Favourites' filter tab in the Navigation bar and must compose with all active filters (search, language, country) so that favourite channels can be further narrowed down.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Yes i want that"
        ]
      },
      "acceptanceCriteria": [
        "Clicking the 'Favourites' tab in the Navigation bar switches the channel grid to show only favourited channels.",
        "For unauthenticated (M3U) users, only channels whose IDs are in localStorage (useLocalFavourites) are displayed.",
        "For authenticated users, only channels returned by the backend getFavourites call are displayed.",
        "The search, language, and country filters remain active and further narrow the visible favourited channels.",
        "When no channels are favourited, a friendly empty-state message is shown (e.g., 'No favourites yet — star a channel to save it here').",
        "Toggling a favourite star on a card while in Favourites view immediately removes it from the visible list.",
        "The Favourites tab is visually highlighted/active when selected, consistent with the existing dark cinematic theme."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "Reuse the existing useLocalFavourites hook for M3U/guest favourite state — do not introduce a second localStorage favourites mechanism.",
    "Reuse the existing backend getFavourites, addFavourite, and removeFavourite functions — do not alter the backend schema."
  ],
  "nonGoals": [
    "Adding a separate dedicated page/route for Favourites — it should remain a filtered view within the existing Channel Browser page.",
    "Changing the backend data model for favourites.",
    "Implementing any new persistence mechanism beyond what already exists."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}