{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix UI rendering in dark mode",
  "requirements": [
    {
      "id": "REQ-18",
      "summary": "Ensure the entire app renders in dark mode by default by applying the 'dark' class to the HTML root element and removing any light-mode fallback styles",
      "acceptanceCriteria": [
        "The app loads in dark mode without any manual toggle required.",
        "The HTML <html> or <body> element has the 'dark' class applied on initial load.",
        "All page backgrounds render as deep dark (#0d0d0d to #1a1a2e range), not white or light grey.",
        "All text elements render in light/white tones against the dark background.",
        "Channel cards, navigation bar, filter controls, modals, and the video player all display dark backgrounds consistent with the cinematic theme.",
        "No component falls back to light-mode colors under any condition."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Add the 'dark' class to the <html> element to permanently activate dark mode for the entire application. This ensures Tailwind's dark: variant classes render correctly and all components use the dark cinematic color tokens defined in index.css."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Remove the @media (prefers-color-scheme: light) block and any light-mode CSS variable definitions. Ensure only the dark mode variables (under :root or .dark) remain active. Add explicit dark background and text color defaults to the @layer base section to prevent any light-mode fallbacks."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Set darkMode configuration to 'class' (if not already set) to ensure Tailwind respects the 'dark' class on the HTML element. Verify that all color definitions reference the oklch CSS variables that map to the dark cinematic palette."
        }
      ]
    }
  ]
}