{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add dedicated Favourites section to channel browser",
  "requirements": [
    {
      "id": "REQ-17",
      "summary": "Add a dedicated 'Favourites' filter view to the channel browser that displays only favourited channels, composing with search/language/country filters and supporting both authenticated and M3U/guest users",
      "acceptanceCriteria": [
        "Clicking the 'Favourites' tab in the Navigation bar switches the channel grid to show only favourited channels.",
        "For unauthenticated (M3U) users, only channels whose IDs are in localStorage (useLocalFavourites) are displayed.",
        "For authenticated users, only channels returned by the backend getFavourites call are displayed.",
        "The search, language, and country filters remain active and further narrow the visible favourited channels.",
        "When no channels are favourited, a friendly empty-state message is shown (e.g., 'No favourites yet — star a channel to save it here').",
        "Toggling a favourite star on a card while in Favourites view immediately removes it from the visible list.",
        "The Favourites tab is visually highlighted/active when selected, consistent with the existing dark cinematic theme."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ChannelBrowser.tsx",
          "operation": "modify",
          "description": "Add filtering logic to apply the 'favourites' filter when activeFilter is 'favourites'. For M3U users, filter combinedChannels by checking if each channel's ID exists in the localFavourites set from useLocalFavourites. For authenticated users, filter against backendFavouriteIds from getFavourites query. Ensure this filtering composes with existing search, language, and country filters. Update the empty state message to show a favourites-specific message ('No favourites yet — star a channel to save it here') when activeFilter is 'favourites' and the filtered list is empty. Verify the component's usage of useLocalFavourites and the getFavourites query before implementing."
        },
        {
          "path": "frontend/src/components/Navigation.tsx",
          "operation": "modify",
          "description": "Update the 'Favourites' tab button to highlight/activate when activeFilter is 'favourites', matching the styling behavior of the existing 'All' and playlist tabs. Ensure the onClick handler sets activeFilter to 'favourites' correctly. Maintain the existing dark cinematic theme styling for the active state (e.g., bg-zinc-700 or similar classes used for the 'All' tab when active)."
        }
      ]
    }
  ]
}